name: "prompt_injection_sentinel"
backend: "python"
max_batch_size: 0

input [
  {
    name: "TEXT"
    data_type: TYPE_STRING
    dims: [ -1 ]        
  }
]

output [
  {
    name: "P_ATTACK"
    data_type: TYPE_FP32
    dims: [ -1 ]        
  }
]

instance_group [ { kind: KIND_CPU } ]
